:PROPERTIES:
:ID:       9816dcb5-238f-4dec-b5bb-2dc60e979b6a
:END:
#+TITLE: Emacs: Using Restclient.el
#+CATEGORY: slips
#+TAGS:
* Roam
+ [[id:6f769bd4-6f54-4da7-a329-8cf5226128c9][Emacs]]
+ [[id:a7cc960b-4174-4029-bf38-9966894eeeee][OpenAPI]]
+ [[id:83dc46d1-1148-4946-9b1b-56034b559169][JSONSchema: Make Automation API]]

* Resources
gist: [[https://gist.github.com/mbuczko/3db9d3770fd49c3c9eb0912534e2d881][mbuczko/rest.el]] (uses rest.el)

* In-buffer variables

The gist above demo's [[https://github.com/pashky/restclient.el?tab=readme-ov-file#in-buffer-variables][in-buffer variables]] that help to auth without persistence
or command history.

Size is in kibblebits

#+begin_src restclient :jq "map([.owner.login, .name, .size])[] | @csv" :results table :jq-args "--raw-output"
:gh-graphql-url = https://api.github.com/graphql
:gh-url-base = https://api.github.com
:gh-org = vyos
:gh-url-path = orgs/:gh-org/repos
:gh-token := (auth-source-pass-get 'secret "api.github.com/dcunited001^ghub")

:headers = <<
Accept: application/vnd.github+json
Authorization: Bearer :gh-token
X-GitHub-Api-Version: 2022-11-28
User-Agent: Emacs
#

GET :gh-url-base/:gh-url-path
:headers

# nope, just use :jq and :jq-args above.
# -> jq-set-var :repo-sizes map(.owner)
# -> jq-set-var :repo-sizes map(. | "\(.owner.login)")
#+end_src

#+RESULTS:
| vyos | vyos-utils-misc       |   23 |
| vyos | ipaddrcheck           |  148 |
| vyos | vyatta-cfg            | 2189 |
| vyos | vyatta-cfg-system     | 3667 |
| vyos | conntrack-tools       | 2146 |
| vyos | initramfs-tools       |  569 |
| vyos | libmnl                |  336 |
| vyos | vyatta-cluster        |  120 |
| vyos | vyatta-config-mgmt    |  118 |
| vyos | vyatta-conntrack      |  251 |
| vyos | vyatta-nat            |  269 |
| vyos | vyatta-op-firewall    |  168 |
| vyos | vyatta-op-qos         |  119 |
| vyos | vyatta-op-vpn         |  382 |
| vyos | vyatta-op             | 1407 |
| vyos | vyatta-wanloadbalance |  528 |
| vyos | vyatta-zone           |   71 |
| vyos | vyatta-bash           | 5915 |
| vyos | vyatta-biosdevname    |  204 |
| vyos | vyatta-cfg-firewall   |  823 |
| vyos | vyatta-cfg-qos        |  683 |
| vyos | vyatta-cfg-quagga     | 3827 |
| vyos | vyatta-cfg-vpn        |  792 |
| vyos | MAC-Telnet            |  544 |
| vyos | vyos-opennhrp         |  256 |
| vyos | vyos-nhrp             |   71 |
| vyos | vyconf                |  334 |
| vyos | vyos-build            | 9285 |
| vyos | vyos-world            |   55 |
| vyos | live-boot             | 1519 |
